export const words = `
я — доре,
ты, вы — доми,
мой — редо,
желание, желать — мифаля,
помощь, помогать — досидо,
любить, любовь — миляси,
я люблю тебя — доре миляси доми,
язык — сольресоль.

`;
export const dictionary = words.split('\n').join('\n>>>\n');

export const faq = `
Записывать сольресоль можно несколькими простыми способами:

названиями нот,
то же, но для краткости опуская гласные,
нотной записью на нотном стане (или просто кружками на трёх горизонтальных линиях),
первыми семью арабскими цифрами,
первыми семью буквами латинского алфавита,
знаками специальной стенографии сольресоль,
цветами радуги (цветными линиями на бумаге).
Речь на сольресоле можно воспроизводить и другими способами:

произношением названий нот вслух,
языком жестов глухонемых,
сериями стуков и других произвольных дискретных сигналов (один раз — до, два раза — ре и т. д.),
игрой на музыкальном инструменте с диатоническим звукорядом,
пением,
жестами, повторяющими знаки стенографии сольресоль,
сигнальными флажками,
цветами радуги (вспышками света или цветными линиями на бумаге),
и т. д. бесконечно.
В устном сольресоле между словами необходимо делать короткие паузы, иначе распознавание границ слов будет затруднено.
`;

export const fullFaq = `

Сольресоль
Материал из Википедии — свободной энциклопедии
Текущая версия страницы пока не проверялась опытными участниками и может значительно отличаться от версии, проверенной 1 декабря 2017; проверки требуют 4 правки.
Перейти к навигацииПерейти к поиску
Сольресоль
Sol-resol.png
Самоназвание	Solresol
Создан	Жан Франсуа Сюдр
Год создания	1827
Категория	искусственный человеческий язык, априорный язык и музыкальный язык[d]
Тип письма	
латиница

слоговое письмо
Языковые коды
ISO 639-1	—
ISO 639-2	—
ISO/DIS 639-3	—
Искусственные языки

Обложка книги Ж. Ф. Сюдра
Сольресоль — международный искусственный язык, основанный на названиях семи нот диатонической гаммы. Его изобрёл француз Жан Франсуа Сюдр в 1817 году. В дальнейшее развитие сольресоля внесли значительный вклад Венсан Гаевски (фр. Vincent Gajewski; ум. 1881), изобретший для него особую стенографическую азбуку (см. ниже), и его сын Сизаль Болеслас Гаевски (фр. Sisal Boleslas Gajewski; ум. 1917), проанализировавший сильные и слабые стороны проекта Сюдра в книге «Examen critique de la langue universelle de Sudre» (1887), а затем составивший «Грамматику сольресоля» (фр. Grammaire du Solresol; 1902).


Содержание
1	Алфавит
2	Примеры
3	Части речи
4	Род и число
5	Смысловые группы
6	Антонимы
7	Синонимы и омонимы
8	Морфология и синтаксис
9	Письменность и другие формы речи
10	Популярность
11	Примечания
12	Литература
13	Ссылки
Алфавит
Алфавит сольресоля состоит из названий семи музыкальных нот (do, re, mi, fa, so, la, si / (ti)), где одна буква означает два нераздельных звука - согласный и гласный. Таким образом, в языке имеется 7 односложных слов, 49 двусложных слов, 343 трёхсложных и 2401 четырёхсложных (всего 2800 слов). Пятисложные слова есть, но в «Грамматике сольресоля» они не упомянуты. Для изучения и использования сольресоля не требуется знакомство с музыкальной грамотой.

Примеры
Некоторые слова и фразы переводятся на сольресоль так:

я — доре,
ты, вы — доми,
мой — редо,
желание, желать — мифаля,
помощь, помогать — досидо,
любить, любовь — миляси,
я люблю тебя — доре миляси доми,
язык — сольресоль.
Части речи
Место фонетического ударения в слове определяет часть речи. В глаголе ударение не ставится, в существительном оно падает на первый слог, в прилагательном — на предпоследний, а в наречии — на последний. Пример:

мидофа — предпочитать,
ми́дофа — предпочтение,
мидо́фа — предпочтительный,
мидофа́ — предпочтительно.
Род и число
В сольресоле имеется три рода — мужской, женский и средний, при этом все неодушевлённые или бесполые объекты имеют средний род, а у остальных род совпадает с полом (аналогично английскому языку). В словах женского рода в устной речи выделяется последний гласный звук. На письме последний слог надчёркивается, либо после слова сверху ставится короткая горизонтальная линия «¯». Слова среднего и мужского рода ничем не выделяются, поэтому можно сказать, что в сольресоле два рода — женский и неженский.

Слова во множественном числе произносятся с удлинением последнего гласного звука так, как если бы он был двойной. На письме над соответствующей буквой ставится диакритический знак острого ударения (акут) «´».

редо — брат,
редō — сестра,
редṓ — сёстры.
Во многих случаях пометки женского рода и множественного числа могут быть опущены, если смысл ясен из соседних слов.

Смысловые группы
Многосложные слова объединяются в смысловые группы по начальным слогам. Например, слова, начинающиеся с соль относятся к наукам и искусству (сольресоль), а с сольсоль — к болезням и медицине (сольсольредо — мигрень). Шесть слов из группы «Время»:

доредо — час,
дореми — день,
дорефа — неделя,
доресоль — месяц,
дореля — год,
дореси — столетие, век.
Антонимы
Для образования антонимов используется инверсия, то есть «переворачивание» слова.

фаля — хороший, хорошо,
ляфа — плохой, плохо.
Домисоль – бог.
Сольмидо – дьявол
Естественно, что у полученных таким образом антонимов нельзя по первым слогам определить смысловую группу.

Синонимы и омонимы
В сольресоле отсутствуют синонимы и омонимы, то есть разные слова всегда означают разное и по-разному записываются.

Морфология и синтаксис
Формы спряжения глаголов по временам, наклонениям, залогам, превосходные степени прилагательных и наречий, отрицательные и вопросительные предложения образуются с помощью вспомогательных слов.

Письменность и другие формы речи
miniatur
Записывать сольресоль можно несколькими простыми способами:

названиями нот,
то же, но для краткости опуская гласные,
нотной записью на нотном стане (или просто кружками на трёх горизонтальных линиях),
первыми семью арабскими цифрами,
первыми семью буквами латинского алфавита,
знаками специальной стенографии сольресоль,
цветами радуги (цветными линиями на бумаге).
Речь на сольресоле можно воспроизводить и другими способами:

произношением названий нот вслух,
языком жестов глухонемых,
сериями стуков и других произвольных дискретных сигналов (один раз — до, два раза — ре и т. д.),
игрой на музыкальном инструменте с диатоническим звукорядом,
пением,
жестами, повторяющими знаки стенографии сольресоль,
сигнальными флажками,
цветами радуги (вспышками света или цветными линиями на бумаге),
и т. д. бесконечно.
В устном сольресоле между словами необходимо делать короткие паузы, иначе распознавание границ слов будет затруднено.

Популярность
Проект Сюдра заслужил неоднократные одобрения различных комиссий Парижской академии наук и многочисленных научных обществ, получил приз в 10 тыс. франков на международной выставке 1851 г. в Париже и почетную медаль на международной выставке в 1862 г. в Лондоне, встретил признание многих выдающихся современников, в их числе Виктора Гюго, Ламартина, Александра Гумбольдта.

После небольшого периода популярности сольресоль сдал свои позиции более успешным искусственным языкам, таким как волапюк и эсперанто.

Примечания
Литература
Александр Пиперски. Сольресоль // Конструирование языков. — Альпина нон-фикшн, 2017. — 224 с. — (Библиотека ПостНауки). — 3000 экз. — ISBN 978-5-91671-635-1.
Ссылки
Логотип Викисловаря	В Викисловаре список слов языка сольресоль содержится в категории «Сольресоль»
Grammar of Solresol (англ.)
Грамматика языка Сольресоль (на русском языке)
[скрыть]⛭
Искусственные языки (список)
Естественный языкИскусственный языкПлановый языкСоциализованный языкМеждународный вспомогательный языкАпостериорный языкГипосхематические языкиГиперсхематические языкиУниверсальный языкСхематизм
Интерлингвистика
[показать]
Апостериорные языки и лингвопроекты
[показать]
Априорные языки и лингвопроекты
[показать]
Смешанные языки и лингвопроекты
Портал:Искусственные языки
Категории: Языки и диалекты по алфавитуИскусственные языкиМеждународные вспомогательные языкиАприорные языки
Навигация
Вы не представились системе
Обсуждение
Вклад
Создать учётную запись
Войти
СтатьяОбсуждение
ЧитатьТекущая версияПравитьПравить кодИсторияПоиск
Искать в Википедии
Заглавная страница
Рубрикация
Указатель А — Я
Избранные статьи
Случайная страница
Текущие события
Участие
Сообщить об ошибке
Сообщество
Форум
Свежие правки
Новые страницы
Справка
Пожертвовать
Инструменты
Ссылки сюда
Связанные правки
Служебные страницы
Постоянная ссылка
Сведения о странице
Цитировать страницу
Печать/экспорт
Создать книгу
Скачать как PDF
Версия для печати
В других проектах
Викисклад
Элемент Викиданных

На других языках
Беларуская
Ελληνικά
English
Français
हिन्दी
Magyar
Polski
Українська
中文
Ещё 33
Править ссылки
Эта страница в последний раз была отредактирована 5 октября 2018 в 11:37.
Текст доступен по лицензии Creative Commons Attribution-ShareAlike; в отдельных случаях могут действовать дополнительные условия. Подробнее см. Условия использования.
Wikipedia® — зарегистрированный товарный знак некоммерческой организации Wikimedia Foundation, Inc.
Политика конфиденциальностиОписание ВикипедииОтказ от ответственностиСвяжитесь с намиМобильная версияРазработчикиСтатистикаЗаявление о кукиWikimedia FoundationPowered by MediaWiki
`;
