const telegram = [
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:27`,
    message: `Check this out on #BandLab https://www.bandlab.com/alezx311/albums/b3555d4e-a43b-eb11-9fb4-0004ffd347fa`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:29`,
    message: `Сделать семплы из первых 10 сек каждого трека в альбоме`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:29`,
    message: `Нарезать семплы по секунде`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:30`,
    message: `Клон позвать с фильтрацией частот, окно ставить степени октавы`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:32`,
    message: `Редюсер создаёт стент двойки в  обновлённом значении или число`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:33`,
    message: `При наличии ключа по степени кидать промис с валидными ключами рендера реактовского плеера`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:34`,
    message: `По координатам курсора проверять количество уникальных ключей промиса`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:36`,
    message: `Они определяют ноту, октаву, длительность, высоту и ключи генерации с такими же ключами от координат`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: `29.03.21 23:37`,
    message: `Если есть строки которые могут быть интерпретированы как названия добавлять их в проигрывател`,
  },
  {
    from: `Alexey Sokolov`,
    timestamp: undefined,
    message: `
    Alexey Sokolov, [26.03.21 22:56]
Пример простой последовательности и набора значений.

Alexey Sokolov, [26.03.21 22:56]
Сыграть после мелодизации.

Alexey Sokolov, [26.03.21 22:56]
Перевести по нарастающей сложности

Alexey Sokolov, [26.03.21 22:57]
Смена значения максимальной длины нот в слове и вывод перевода

Alexey Sokolov, [26.03.21 22:58]
Перевод должен быть воспроизводимым аудио из jaon

Alexey Sokolov, [26.03.21 22:58]
Генерить мелодии в json

Alexey Sokolov, [26.03.21 22:58]
Сохранять валидные в бд

Alexey Sokolov, [26.03.21 22:59]
В дальнейшем они могут быть использованы при переобучении как запасные части при совпадении мелодики и риьма

Alexey Sokolov, [26.03.21 23:22]
https://drive.google.com/folderview?id=0BzeOLO8lR7OsYi1HS3JjMk8yVEE

Alexey Sokolov, [26.03.21 23:23]
[ Audio file : 2_5449763210234170163.mp3 ]

Alexey Sokolov, [26.03.21 23:23]
Вот усложнённая

Alexey Sokolov, [26.03.21 23:24]
Должна быть возможность использовать семплы для фона

Alexey Sokolov, [26.03.21 23:24]
Юзать ссыль на диск для бекапа в папке js

Alexey Sokolov, [26.03.21 23:25]
[ Audio file : Gm speed.mp3 ]

Alexey Sokolov, [26.03.21 23:26]
Вот в этой найти отрезки с двумя высотами

Alexey Sokolov, [26.03.21 23:26]
Использовать их для генерации мелодии

Alexey Sokolov, [26.03.21 23:27]
Дефолтный ключ G

Alexey Sokolov, [26.03.21 23:27]
Миксовать минор, пентатоника и блюзовые шкалы в разных местах

Alexey Sokolov, [26.03.21 23:28]
До того как это будет нужно давать случайные ноты

Alexey Sokolov, [26.03.21 23:28]
Юзнуть баш скрипт для работы с текстом для создания бд

Alexey Sokolov, [26.03.21 23:31]
Приоритет на звук. Только с непрерывной подачей с обработкой закрытия браузера и переоткрытия соединения
    `,
  },
]
